In [108]:
import sqlite3
import pandas as pd

In [109]:
con = sqlite3.connect(':memory:')

In [110]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [111]:
for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [112]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

In [113]:
tasks+=1
pd.read_sql(
    '''
    SELECT Distinct (CustomerName), Country, Address
    FROM Customers
    WHERE Country in ('Germany', 'France')
    or City = 'Madrid'
    ''',
    con,
)

,CustomerName,Country,Address
0,Alfreds Futterkiste,Germany,Obere Str. 57
1,Blauer See Delikatessen,Germany,Forsterstr. 57
2,Blondel p√®re et fils,France,"24, place Kl√©ber"
3,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67"
4,Bon app',France,"12, rue des Bouchers"
5,Drachenblut Delikatessend,Germany,Walserweg 21
6,Du monde entier,France,"67, rue des Cinquante Otages"
7,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86"
8,Folies gourmandes,France,"184, chauss√©e de Tournai"
9,Frankenversand,Germany,Berliner Platz 43
10,France restauration,France,"54, rue Royale"
11,K√∂niglich Essen,Germany,Maubelstr. 90
12,La corne d'abondance,France,"67, avenue de l'Europe"
13,La maison d'Asie,France,1 rue Alsace-Lorraine
14,Lehmanns Marktstand,Germany,Magazinweg 7
15,Morgenstern Gesundkost,Germany,Heerstr. 22
16,Ottilies K√§seladen,Germany,Mehrheimerstr. 369
17,Paris sp√©cialit√©s,France,"265, boulevard Charonne"
18,QUICK-Stop,Germany,Taucherstra√üe 10
19,Romero y tomillo,Spain,"Gran V√≠a, 1"
20,Sp√©cialit√©s du monde,France,"25, rue Lauriston"
21,Toms Spezialit√§ten,Germany,Luisenstr. 48
22,Victuailles en stock,France,"2, rue du Commerce"
23,Vins et alcools Chevalier,France,59 rue de l'Abbaye
24,Die Wandernde Kuh,Germany,Adenauerallee 900

2. –í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

In [114]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
        CustomerName,
        COUNT(CustomerName) AS Number_of_customers
    FROM Customers
    GROUP BY Country
    ORDER BY Number_of_customers DESC 
    LIMIT 3
    ''',
    con,
)

              CustomerName  Number_of_customers
0  Great Lakes Food Market                   13
1      Alfreds Futterkiste                   11
2     Blondel p√®re et fils                   11

3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

In [115]:
tasks+=1
pd.read_sql(
    '''
    SELECT ShipperName, OrderDate
    FROM Shippers AS Sh JOIN Orders AS Ord
    ON Sh.ShipperID == Ord.ShipperID
    Order by OrderDate
    LIMIT 9,1
    ''',
    con,
)

        ShipperName   OrderDate
0  Federal Shipping  02.10.1996

4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

In [116]:
tasks+=1
pd.read_sql(
    '''
    WITH find_total_price_for_quantity as (
        SELECT 
            Od.OrderID,
            Od.ProductID,
            Pr.ProductName,
            sum(Od.Quantity)*Pr.Price as Cost_for_quantity

        FROM OrderDetails AS Od JOIN Products AS Pr
        ON Od.ProductID = Pr.ProductID
    
        group by Od.OrderID, Od.ProductID, Pr.ProductName
    ),
    find_total_cost_for_order as (
        SELECT 
            OrderID,
            SUM(Cost_for_quantity) AS Total_cost_for_order
        FROM find_total_price_for_quantity
        GROUP BY OrderID
        ORDER BY Total_cost_for_order DESC
        LIMIT 1
    )
    SELECT 
        OrderID,
        ProductName,
        Cost_for_quantity
    FROM find_total_price_for_quantity
    WHERE OrderID = (SELECT OrderID FROM find_total_cost_for_order)
    ORDER BY Cost_for_quantity
        
    ''',
    con,
)

   OrderID             ProductName  Cost_for_quantity
0    10372  Sir Rodney's Marmalade              972.0
1    10372  Mozzarella di Giovanni             1461.6
2    10372       Camembert Pierrot             2380.0
3    10372           C√¥te de Blaye            10540.0

5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

In [117]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
        ProductName,
        Quantity,
        OrderID
    FROM OrderDetails AS Od JOIN Products AS Pr
        ON Od.ProductID = Pr.ProductID
    WHERE Od.ProductID == (
        SELECT 
            ProductID
        FROM OrderDetails
        GROUP BY OrderID, ProductID
        ORDER BY SUM(Quantity) DESC, OrderID
        LIMIT 1
    )
    ORDER BY Quantity DESC

    
    ''',
    con,
)

    ProductName  Quantity  OrderID
0  P√¢t√© chinois       120    10398
1  P√¢t√© chinois        40    10342
2  P√¢t√© chinois        21    10254
3  P√¢t√© chinois        20    10280
4  P√¢t√© chinois        15    10389
5  P√¢t√© chinois        12    10356
6  P√¢t√© chinois        10    10425

6. –í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [118]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
        SupplierName, 
        Country,
        ContactName,
        Phone
    FROM Suppliers
    WHERE SupplierID IN (
        SELECT 
            SupplierID
        FROM OrderDetails AS Ord JOIN Products AS Pr
        ON Ord.ProductID = Pr.ProductID
        GROUP BY SupplierID
        ORDER BY COUNT(OrderID) DESC
        LIMIT 5
    )
    ''',
    con,
)

                        SupplierName    Country   ContactName           Phone
0                      Pavlova, Ltd.  Australia   Ian Devling   (03) 444-2343
1           Specialty Biscuits, Ltd.         UK  Peter Wilson  (161) 555-4448
2  Plutzer Lebensmittelgro√üm√§rkte AG    Germany   Martin Bein    (069) 992755
3            Formaggi Fortini s.r.l.      Italy    Elio Rossi    (0544) 60323
4                    Norske Meierier     Norway  Beate Vileid     (0)2-953010

7. –ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

In [119]:
tasks+=1
pd.read_sql(
    '''
    WITH Main_table AS ( 
        SELECT 
            Od.OrderID,
            Pr.ProductID, 
            Cat.CategoryName,
            Cus.Country,
            sum(Od.Quantity)*Pr.Price as Cost_for_quantity

        FROM OrderDetails AS Od 

            JOIN Products AS Pr ON Od.ProductID = Pr.ProductID
            JOIN Categories AS Cat ON Cat.CategoryID = Pr.CategoryID
            JOIN Orders AS Ord ON Od.OrderID = Ord.OrderID
            JOIN Customers AS Cus ON Cus.CustomerID = Ord.CustomerID

        WHERE Cus.Country = 'Brazil'
        GROUP BY Od.OrderID, Od.ProductID, Cat.CategoryName, Cus.Country
    )
    SELECT 
        Country,
        CategoryName,
        sum(Cost_for_quantity) as Cost_for_category
    FROM Main_table
    GROUP BY CategoryName, Country
    ORDER BY Cost_for_category DESC
    LIMIT 1
    ''',
    con,
)

  Country CategoryName  Cost_for_category
0  Brazil    Beverages            13690.0

8. –ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

In [120]:
tasks+=1
pd.read_sql(
    '''
    WITH find_total_price_for_quantity as (
        SELECT 
            Od.OrderID,
            Od.ProductID,
            sum(Od.Quantity)*Pr.Price as Cost_for_quantity

        FROM OrderDetails AS Od JOIN Products AS Pr
        ON Od.ProductID = Pr.ProductID
    
        group by Od.OrderID, Od.ProductID, Pr.ProductName
    ),
    Total_cost_for_order_for_USA as (
        SELECT 
            SUM(Cost_for_quantity) AS Total_cost_for_order
        FROM find_total_price_for_quantity AS TP 
            JOIN Orders AS Ord ON Tp.OrderID = Ord.OrderID
            JOIN Customers AS Cus ON Cus.CustomerID = Ord.CustomerID
        WHERE Cus.Country = 'USA'
        GROUP BY Ord.OrderID
    )
    SELECT 
        MAX(Total_cost_for_order) - MIN(Total_cost_for_order) AS Diff_between_max_and_min_cost
    FROM Total_cost_for_order_for_USA  
    ''',
    con,
)

   Diff_between_max_and_min_cost
0                        7638.45

9. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

In [121]:
tasks+=1
pd.read_sql(
    '''
    SELECT
        COUNT(OrderID) AS Count_of_orders,
        Emp.FirstName || ' '|| Emp.LastName AS Name_and_surname
   
    FROM Orders AS Ord JOIN Employees AS Emp ON Emp.EmployeeID = Ord.EmployeeID
    GROUP BY Emp.EmployeeID
    ORDER BY substr(BirthDate,7,4) DESC, substr(BirthDate,4,2) DESC, substr(BirthDate,1,2) DESC
    LIMIT 3
    ''',
    con,
)

   Count_of_orders Name_and_surname
0                6   Anne Dodsworth
1               29    Nancy Davolio
2               31  Janet Leverling

10. –°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

In [122]:
tasks+=1
pd.read_sql(
    '''
    SELECT 
        SUM(Ord.Quantity * substr(Pr.Unit,1,2)) AS Total_number_of_tins
    FROM Products AS Pr Join OrderDetails AS Ord ON Pr.ProductID=Ord.ProductID
    WHERE ProductName like 'Boston Crab Meat'
    ''',
    con,
)

   Total_number_of_tins
0                  6144

In [123]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ